slime7/remapad/firmware/sdkconfig.defaults
# PocketJS ESP-IDF components require ESP-IDF >= 6.0 and < 6.2.
CONFIG_IDF_TARGET="esp32s3"

# Product hardware: ESP32-S3R8 (8MB embedded Octal PSRAM) with 16MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# OTA 回滚保护：新镜像先以「待验证」状态启动，等 UI 首帧成功且稳定运行满
# OTA_HEALTH_MIN_UPTIME_US（ota_session.c）才标记有效；在此之前重启，引导器
# 回退到升级前的镜像。串口 CLI 的 rollback 命令也依赖这个状态。
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# 8MB Octal PSRAM is used by the PocketJS guest and UI framebuffer.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_BOOT_INIT=y

# Match the official PocketJS ESP-IDF examples for the application task.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# 串口 CLI 复用唯一的 Type-C（USB-Serial/JTAG）：主控制台切到 USJ，日志
# 与行命令输入共用 COM 口；日志走非阻塞 vfs，未连接时丢弃不阻塞任务。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# The PocketJS UI runs an interpreted Vue Vapor bundle plus the software RGB565
# renderer on one core, so the SoC runs at its rated 240 MHz instead of the
# 160 MHz default.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Board touch panel is a CST816T; the espressif CST816S driver's chip ID read
# can break init on T-variant silicon.
CONFIG_ESP_LCD_TOUCH_CST816S_DISABLE_READ_ID=y

# Bluetooth LE controller peripheral (ADR 0010): NimBLE host, BLE-only,
# no SMP (NS2 pairing is a private protocol), host memory in PSRAM.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2

# NS2 主机把连接压到 5ms（4 单位，低于 BLE 规范的 7.5ms 下限），控制器必须
# 放行亚规范间隔主机下发的更新才能落地。ESP32-C3/S3 控制器允许亚规范间隔由
# 这个开关控制（bt.c 据此调用 ble_min_conn_interval_enable(3)，最低 3.75ms），
# IDF 6.1 默认开启，这里显式写出以免后续版本默认值变化悄悄带偏。NimBLE 主机
# 侧仍按规范拒绝 itvl < 6 的主动请求，因此本工程不主动请求连接参数，只接受
# 主机下发的值（输入被采用的门槛是 0x0C/0x04 特性启用与稳定上报流，见
# ADR 0023）。
CONFIG_BT_CTRL_BLE_MIN_CONN_INTERVAL_ENABLE=y

# NS2 主机只认经扩展广播 HCI 路径（LE Set Extended Advertising Parameters，
# legacy_pdu=1）下发的 legacy PDU；缓冲参数对齐已验证可被 NS2 发现的
# ESP32 实现（zhantss/ESP32-BLE5-NSController-Emulator）。
CONFIG_BT_NIMBLE_EXT_ADV=y
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=255
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=150
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_SIZE=128
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=30
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_SIZE=512
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=30
